app/views/madein_ksa/showclass.html.erb

                 <span class="">
                  <% @ar_breadcrum_home = Language.select("language_property").where("language_id = ?  AND language_type = ? ", '14','ar')%>
---
SELECT `languages`.`language_property` FROM `languages` WHERE (language_id = '12' AND controller_name = 'langs' AND page_name = 'show.html.erb' AND language_type = 'en' )