app/views/madein_ksa/view.html.erb

                 <span class="">
                  <% @ar_breadcrum_home = Language.select("language_property").where("language_id = ?  AND language_type = ? ", '14','ar')%>
---
SELECT `languages`.`language_property` FROM `languages` WHERE (language_id = '17'  AND language_type = 'en' )

                                        <tr>
                                          <td><input type="radio" name="supplier_sel" id="supplier_sel" onclick="getsupplier(this.value);" value="<%= v.Factory_Name %> ,<%= v.Factory_ID %>"></td>
---
SELECT `mm_factories`.* FROM `mm_factories` WHERE (`Last Status` = 'OPERATIONAL' AND  Language = 'en')