app/controllers/langs_controller.rb

  def view
	language =I18n.locale
	#language ='ar'
	var = request.query_parameters
	@data=var['Factory_ID']
	 @show=var['map']
	# @data1="Factory_Name" language
	@name =Factory.select("Value").where("Factory_ID = ? AND Client_seq = ? AND language = ?", @data,'1',language)
	@fname =Factory.select("Value","property","Client_seq").where("Factory_ID = ? AND Client_seq = ? AND language = ?", @data,'1',language)
---
SELECT `factories`.`Value` FROM `factories` WHERE (Factory_ID = '1' AND Client_seq = '1' AND language = 'en')
SELECT `factories`.`Value`, `factories`.`property`, `factories`.`Client_seq` FROM `factories` WHERE (Factory_ID = '1' AND Client_seq = '2' AND language = 'en' )

	@find_land=Factory.select("Value","property","Client_seq").where("Factory_ID = ? AND Client_seq = ? AND language = ? ", @data,'23',language)
	@fmfg_isic=Factory.select("Value","property","Client_seq").where("Factory_ID = ? AND Client_seq = ? AND language = ? ", @data,'28',language)
	@fmfg_capacity=Factory.select("Value","property","Client_seq").where("Factory_ID = ? AND Client_seq = ? AND language = ? ", @data,'29',language)
	@fmfgcount=Factory.where("Factory_ID = ? AND Client_seq = ? AND language = ? ", @data,'28',language).count
---
SELECT COUNT(*) FROM `factories` WHERE (Factory_ID = '1' AND Client_seq = '28' AND language = 'en' )