app/controllers/madein_ksa_controller.rb

SELECT `classifications`.* FROM `classifications` WHERE (cat_id = '3660057' )
SELECT `rxml_references`.`property`, `rxml_references`.`value` FROM `rxml_references` WHERE (cat_id = '3660057')
SELECT COUNT(`rxml_references`.`Seq`) FROM `rxml_references` WHERE (cat_id = NULL AND property = 'SUPPLIER REFERENCE')
SELECT MAX(`classifications`.`cmm_material_no`) FROM `classifications`
SELECT `corp_ignames`.`Class_Name`, `corp_ignames`.`igref`, `corp_ignames`.`Class_id` FROM `corp_ignames`
SELECT `mm_factories`.* FROM `mm_factories` WHERE (`Last Status` = 'OPERATIONAL' AND  Language = 'en')
---
  def view

lan= I18n.locale

var=request.query_parameters
@id=var[:cat_id]
@data=Classification.where("cat_id = ? ",@id)
@data1=TechnicalSpecification.select("property","value","Seq","propertyRef","Class","source","name","datecreated").order(:Seq).where("cat_id = ? ",@id)
@data2=RxmlReference.select("property","value","Seq","value2").where("cat_id = ?",@id)
@data3=RxmlReference.select("cat_id,property","value","Seq","value2","datadeleted").where("cat_id = ? AND property = ?",@id,'SUPPLIER REFERENCE')
@data4=RxmlReference.where("cat_id = ? AND property = ?",@id,'SUPPLIER REFERENCE').count("Seq")
# @image = Image.where("cat_id = ?",@id).find_by_id("file_content")
#@image=Image.find_by_id(params[:cat_id])
@image=Image.where("cat_id = ?",@id)
# @image=Image.find_by_id(params[:cat_id])

#     if(@image.nil?)
#       @img='noimage'
#     else
#       @img='image'
#     end
@len=Setting.where("organization_ID=123")
@a=(Classification.maximum("cmm_material_no"))+1
@class_sel=CorpIgname.select("Class_Name","igref","Class_id")
@vendor=MmFactory.where(["`Last Status` = ? AND  Language = ?",'OPERATIONAL',lan])

SELECT `technical_specifications`.`property`, `technical_specifications`.`value` FROM `technical_specifications` WHERE (cat_id = '3660057' AND language='en')
---
                                  @es=@es.upcase
                                end

                                    @update=TechnicalSpecification.where('Seq = ? AND property = ? AND cat_id = ? ',@es,@ds,@id).update_all(value: @cs,lastmodified: Time.now)

SELECT count(*) FROM `classifications` where catalog_name!='NULL' group by catalog_name order by count(*) DESC limit 0,1
---
def detail_view
    @classname_count=Classification.count(:cat_id)

SELECT COUNT(*) FROM `classifications` WHERE (catalog_name = 'PIPE,METALLIC')
---
 def showclass
    lan= I18n.locale
      vars = request.query_parameters
      @type = vars['TYPE']
    if @type =='all'
      if params[:search]
            @vs = params[:search]
            @madein_ksa = initialize_grid(Classification,conditions:["(cat_id like ? OR short_description like ? OR long_description like ?)","%#{@vs}%","%#{@vs}%","%#{@vs}%"],:per_page=>10)
            @madeinksacount=Classification.where("(cat_id like ? OR short_description like ? OR long_description like ?)","%#{@vs}%","%#{@vs}%","%#{@vs}%").count

SELECT COUNT(*) FROM `classifications` WHERE (FACTORY_ID = '25738')
---
  def showfactory
    lan= I18n.locale
  vars = request.query_parameters
  @type = vars['FACTORY']
  if @type =='all'
    if params[:search]
          @vs = params[:search]
          @madein_ksa = initialize_grid(Classification,conditions:["(cat_id like ? OR short_description like ? OR long_description like ?)","%#{@vs}%","%#{@vs}%","%#{@vs}%"],:per_page=>10)
          @factorycount=Classification.where("(cat_id like ? OR short_description like ? OR long_description like ?)","%#{@vs}%","%#{@vs}%","%#{@vs}%").count