app/controllers/source_data_controller.rb

  def dictionary_detail
    # if session[:user_id]
    vars = request.query_parameters
    @esci = vars['esci']
    @term = vars['term']
    @definition = vars['def']
    #@mm = User.where("id = ?", 4).select( "user_fname, user_lname")
    @mm =Term_dn.where("term_ID = ? ", @term )
    @def =Definition.where("definition_ID = ? ", @definition )
    @con_dn =Concept_dn.where("concept_ID = ? AND term_ID = ? ", @esci, @term)
---
SELECT `concept_dn`.* FROM `concept_dn` WHERE (concept_ID = '0161-1#02-015084#1' AND term_ID = '0161-1#TM-084522#1' AND definition_ID = '0161-1#DF-081826#1' )