app/controllers/source_data_controller.rb

      # db_classification_first=@db_classification.to_s.first(1).to_i
      # @ds= db_classification_first.to_s.ljust(@db_classification_count.to_i,'0')
      # @ds_classification= @ds.to_i * 2
      @db_classification = Classification.count(:cat_id)
---
SELECT COUNT(`classifications`.`cat_id`) FROM `classifications`

      # @ds= db_factory_first.to_s.ljust(@db_factory_count.to_i,'0')
      # @ds_factory= @ds.to_i * 2

      @db_factory = MmFactory.where(["Language= ?", 'en']).count
---
SELECT COUNT(*) FROM `mm_factories` WHERE (`Last Status`= 'Cancel Suggestion')

  def edit
     #if session[:user_id]
      vars = request.query_parameters
      @vid = vars['NSN']
      @part = vars['PART']
        @cage = vars['CAGE']
        @vendor = vars['vendor']
          @count_NSN = ASegment.where(["ECCMA_NSN= ?", @vid])
          #if @count_NSN.count == 1
             @a_seg = ASegment.where(["ECCMA_NSN= ?", @vid])
         # else

           #
        #end
        @nsnmrcxs =Nsnmrcxs.where(["ECCMA_NSN= ?", @vid])
---
SELECT `a_segments`.* FROM `a_segments` WHERE (ECCMA_NSN= '1005004490538')
SELECT `nsnmrcxs`.* FROM `nsnmrcxs` WHERE (ECCMA_NSN= '1005000499324')

  def dictionary_detail
  # if session[:user_id]
    vars = request.query_parameters
    @esci = vars['esci']
    @term = vars['term']
    @definition = vars['def']
    #@mm = User.where("id = ?", 4).select( "user_fname, user_lname")
     # @mm =Term_dn.where("term_ID = ? ", @term )
     # @def =Definition.where("definition_ID = ? ", @definition )
      @con_dn =Term_dn.where("concept_ID = ? AND term_ID = ? AND definition_ID = ? ", @esci, @term ,@definition)
---
SELECT `term_dn`.* FROM `term_dn` WHERE (concept_ID = '0161-1#02-015084#1' AND term_ID = '0161-1#TM-084522#1' AND definition_ID = '0161-1#DF-081826#1' )

  def cage_details
    vars = request.query_parameters
    @cage_code = vars['CAGE']
      @cage_details =CageDetail.where("CAGE_CD = ? ", @cage_code )
---
SELECT `cage_details`.* FROM `cage_details` WHERE (CAGE_CD = 'U4574' )

  def cleansed
    if params[:search]
      @vs = params[:search]
      #search= 19207
       @cleansed = initialize_grid(CmmClassification ,conditions:["(cat_id like ? OR short_description like ? OR long_description like ?) ","%#{@vs}%","%#{@vs}%","%#{@vs}%"], :per_page => 10)
        @cleansedcount=CmmClassification.where("(cat_id like ? OR short_description like ? OR long_description like ?)","%#{@vs}%","%#{@vs}%","%#{@vs}%").count

      else
       @cleansed = initialize_grid(CmmClassification , :per_page => 10)
       @cleansedcount=CmmClassification.count(:cat_id)
---
SELECT COUNT(`cmm_classifications`.`cat_id`) FROM `cmm_classifications`

  def editcleansed
    vars = request.query_parameters
    @id = vars['cat_id']
    @data=CmmClassification.where("cat_id = ? ",@id)
    @technical=CmmTechnicalSpecification.select("propertyRef","value","source").where("cat_id = ? ",@id)
    @reference=CmmRxmlReference.select("property","value","value2").where("cat_id = ?",@id)
---
SELECT `cmm_classifications`.* FROM `cmm_classifications` WHERE (cat_id = '3665065' )
SELECT `cmm_technical_specifications`.`propertyRef`, `cmm_technical_specifications`.`value`, `cmm_technical_specifications`.`source` FROM `cmm_technical_specifications` WHERE (cat_id = '3665065' )
SELECT `cmm_rxml_references`.`property`, `cmm_rxml_references`.`value`, `cmm_rxml_references`.`value2` FROM `cmm_rxml_references` WHERE (cat_id = '3665065')