app/controllers/user_controller.rb

SELECT `users`.* FROM `users`
---
  def list
	@users = User.all

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 8  ORDER BY `users`.`id` ASC LIMIT 1
---
  def edit
	@user = User.find(params[:id])

DELETE FROM `users` WHERE `users`.`id` = 4
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 8  ORDER BY `users`.`id` ASC LIMIT 1
---
  def delete
	 User.find(params[:id]).destroy