app/views/langs/show.html.erb

SELECT `languages`.`language_property` FROM `languages` WHERE (language_id = '12' AND controller_name = 'langs' AND page_name = 'show.html.erb' AND language_type = 'en' )
---
                <span class="">
                  <% @ar_breadcrum_home = Language.select("language_property").where("language_id = ?  AND language_type = ? ", '14','ar')%>

SELECT `mm_factories`.* FROM `mm_factories` WHERE (`Last Status`= 'UNDER CONSTRUCTION' AND Language = 'en') AND ( mm_factories.Factory_ID = 401.0 )
---
                    #s.action_column
                    s.column :name => 'FACTORY ID', :attribute => 'Factory_ID' do |s|