app/views/source_data/morensn.html.erb

                            <div class="pull-left" style="width:15px;height:15px;;background-color:#ffff;"></div>
                            <div class="pull-left"> <a href="<%= url_for :controller => 'source_data', :action => 'source',:TYPE => 'COUNTRY' ,:NSNTYPE => 'GIVEN',:FORCE => 'all' %>"  title='View Factory details', data-toggle= 'tooltip', data-placement='bottom' target="_blank"> &nbsp;&nbsp;Total Country<% @more_country.each do |c| %>
---
SELECT COUNTRY_ECCMA,count(*) As total FROM `source_data` where ECCMA_FLAG in ('UKV','GMV','FRV','USV')


                                <% @cagename_1 = CageDetail.select("CAGE_Name").where("CAGE_CD = ?", c.CAGEC)%>
---
SELECT `cage_details`.`CAGE_Name` FROM `cage_details` WHERE (CAGE_CD = 'D8009')