app/views/source_data/sourceref.html.erb

SELECT `languages`.`language_property` FROM `languages` WHERE (language_id = '13' AND controller_name = 'langs' AND page_name = 'show.html.erb' AND language_type = 'en' )
---
                <span class="">
                  <% @ar_breadcrum_home = Language.select("language_property").where("language_id = ?  AND language_type = ? ", '14','ar')%>