app/views/source_data/viewsource.html.erb

                <span class="">
                  <% @ar_breadcrum_home = Language.select("language_property").where("language_id = ?  AND language_type = ? ", '14','ar')%>
---
SELECT `languages`.`language_property` FROM `languages` WHERE (language_id = '14'  AND language_type = 'en' )